Repository: MTES-MCT/monitorfish
Catalog: pipeline/docs/locale/*/LC_MESSAGES/architecture.po
Languages: fr

source: Monitorfish is built around 3 main components :
fr: Monitorfish comporte 3 composants principaux :

source: It receives and collects data from several external systems. This diagram gives an overview of the entire system :
fr: L'application reçoit et collecte des données provenant de plusieurs systèmes externes. Ce diagramme donne un aperçu de l'ensemble du système :

source: Architecture diagram
fr: Schéma d'architecture

source: The following sections give more details about the backend, frontend and data pipeline components.
fr: Les sections suivantes fournissent plus de détails sur les composants backend, frontend et pipeline de données.

source: Flyway (database migration)
fr: Flyway (migrations de base de données)

source: PostgreSQL with PostGIS/TimescaleDB
fr: PostgreSQL avec extensions PostGIS et TimescaleDB

source: Data pipeline
fr: Pipeline de données

source: The data processing service executes python batch jobs to :
fr: Le pipeline de données exécute des tâches en python pour :

source: pull data from external sources into the Monitorfish database (ETL)
fr: extraire des données de sources externes vers la base de données Monitorfish (ETL)

source: process data in the Monitorfish database to enrich and update tables that the backend makes available to the frontend through an API
fr: traiter les données de la base de données Monitorfish pour enrichir et mettre à jour les tables que le backend met à la disposition du frontend par le biais d'une API

source: publish data online
fr: publier des données en ligne

source: Database schema
fr: Schéma de base de données

source: Database tables are created by the :ref:`back-end`. Jobs of the data pipeline require tables to already exist and to have the right columns and data types. It is therefore necessary to keep the back end and the data pipeline applications "in sync". For this reason, the back end and the data pipeline should always be deployed with the **same version number** (see :ref:`environment_variables`).
fr: Les tables de base de données sont créées par le :ref:`back-end`. Les tâches du pipeline de données exigent que les tables existent déjà et qu'elles aient les bonnes colonnes et les bons types de données. Il est donc nécessaire que les applications du back-end et du pipeline de données restent "synchronisées". Pour cette raison, le back-end et le pipeline de données doivent toujours être déployés avec le **même numéro de version** (voir :ref:`environment_variables`).

source: Batch jobs are orchestrated by `Prefect <https://prefect.io>`__. For more information see `Prefect documentation <https://docs.prefect.io/v3/get-started/>`__.
fr: Les tâches par lots sont orchestrées par `Prefect <https://prefect.io>`__. Pour plus d'informations, consultez la `documentation Prefect <https://docs.prefect.io/v3/get-started/>`__.

source: The prefect UI enables administrators to monitor their execution, see the logs and debug in case any flow run fails...
fr: L'interface utilisateur Prefect permet aux administrateurs de surveiller leur exécution, de consulter les journaux et de déboguer en cas d'échec d'un traitement...

source: Execution
fr: Exécution

source: The main tools used to extract data, process it in python and load it to the PostgreSQL database of Monitorfish are :
fr: Les principaux outils utilisés pour extraire les données, les traiter en python et les charger dans la base de données PostgreSQL de Monitorfish sont :

source: `SQLAlchemy <https://www.sqlalchemy.org/>`__ as a python SQL toolkit to interact with SQL databases
fr: `SQLAlchemy <https://www.sqlalchemy.org/>`__ comme une boîte à outils SQL en python pour interagir avec les bases de données SQL.

source: Database adapters `cx_Oracle <https://oracle.github.io/python-cx_Oracle/>`__, `psycopg2 <https://github.com/psycopg/psycopg2/>`__ and `ClickHouse Connect <https://clickhouse.com/docs/integrations/python/>`__ for connectivity to Oracle, PostgreSQL and ClickHouse databases respectively
fr: les adaptateurs de base de données `cx_Oracle <https://oracle.github.io/python-cx_Oracle/>`__, `psycopg2 <https://github.com/psycopg/psycopg2/>`__ et `ClickHouse Connect <https://clickhouse.com/docs/integrations/python/>`__ pour la connectivité aux bases de données Oracle, PostgreSQL et ClickHouse respectivement.

source: `pandas <https://pandas.pydata.org/>`__ and `DuckDB <https://duckdb.org/>`__ for data manipulation in python
fr: `pandas <https://pandas.pydata.org/>`__ et `DuckDB <https://duckdb.org/>`__ pour la manipulation de données en Python

source: the `prefect python library <https://github.com/prefecthq/prefect>`__ to write batch jobs as flows of tasks
fr: la `librairie python prefect <https://github.com/prefecthq/prefect>`__ pour écrire les tâches de traitement de données en tant que flows

source: Flows : one for each job
fr: Flows : un pour chaque traitement de données

source: Batch jobs are written in python as prefect :ref:`flows <flows>` : each flow is responsible for one particular task, such as updating the ``vessels`` referencial or refreshing the table of ``last_positions``.
fr: Les traitements de données sont écrits en python sous forme de :ref:`flows` prefect : chaque flow est responsable d'une tâche particulière, comme la mise à jour du référentiel ``vessels`` ou le rafraîchissement de la table des ``last_positions``.

source: Execution in a dockerized service
fr: Exécution dans un service dockerisé

source: A `prefect worker <https://docs.prefect.io/v3/concepts/workers>`__ constantly polls the Prefect API in order to know if any flow must be executed. When a flow must be executed, perfect server tells the worker, which spawns a runner that runs the flow in an ephemeral docker container.
fr: Un `worker Prefect <https://docs.prefect.io/v3/concepts/workers>`__ interroge en permanence l'API Prefect afin de savoir si un *flow* doit être exécuté. Lorsqu'un *flow* doit être exécuté, Perfect Server en informe le *worker*, qui lance un runner qui exécute le *flow* dans un conteneur Docker éphémère.
