Repository: MTES-MCT/monitorfish
Catalog: pipeline/docs/locale/*/LC_MESSAGES/fleet-segments.po
Languages: fr

source: Fleet segments
fr: Segments de flotte

source: The European Fishing Control Agency's `Guidelines on Risk Assessment Methodology <https://www.efca.europa.eu/en/content/guidelines-risk-assessment-methodology-fisheries-compliance>`_ define fleet segments as *'fishery units with similar fishing characteristics (e.g., gear, area and target species)'*.
fr: Les `Lignes directrices sur la méthodologie d'évaluation des risques <https://www.efca.europa.eu/en/content/guidelines-risk-assessment-methodology-fisheries-compliance>`_ de l'Agence européenne de contrôle des pêches définissent les segments de flotte comme *"des unités de pêche présentant des caractéristiques de pêche similaires (par exemple, engin, zone et espèces cibles) "*.

source: Each member state is responsible for defining the fleet segments relevant to its waters and to perform risk assessments on each segment.
fr: Chaque État membre est chargé de définir les segments de flotte pertinents pour ses eaux et d'effectuer une évaluation des risques pour chaque segment.

source: Fleet segment risk assessment and control objectives
fr: Évaluation des risques et objectifs de contrôle du segment de flotte

source: In France, fleet segments were defined by the `Direction des Pêches Maritimes et de l'Aquaculture <https://agriculture.gouv.fr/administration-centrale>`_, and risk assessments on these fleet segments are performed each year by the `Directions Interrégionales de la Mer <https://fr.wikipedia.org/wiki/Direction_interr%C3%A9gionale_de_la_Mer#:~:text=Les%20directions%20interr%C3%A9gionales%20de%20la,marin%20et%20gestion%20des%20ressources>`_.
fr: En France, les segments de flotte ont été définis par la `Direction des Pêches Maritimes et de l'Aquaculture <https://agriculture.gouv.fr/administration-centrale>`_, et les évaluations des risques sur ces segments de flotte sont réalisées chaque année par les `Directions Interrégionales de la Mer <https://fr.wikipedia.org/wiki/Direction_interr%C3%A9gionale_de_la_Mer#:~:text=Les%20directions%20interr%C3%A9gionales%20de%20la,marin%20et%20gestion%20des%20ressources>`_.

source: During this process, a **risk level** is computed for each fleet segment based on
fr: Au cours de ce processus, un **niveau de risque** est calculé pour chaque segment de flotte sur la base des éléments suivants

source: scientific data on the **state of the stock** (healthy, threatened, collapsed...)
fr: des données scientifiques sur l' **état du stock** (sain, menacé, effondré...)

source: national metrics to estimate the **pressure** that the fishing activity puts on the stock and the **level of non-compliance** observed on the fleet segment
fr: des métriques nationales pour estimer la **pression** exercée par l'activité de pêche sur le stock et le **niveau de non-conformité** observé sur le segment de flotte.

source: This risk level represents the **impact of the fishing activity** on the ressources.
fr: Ce niveau de risque représente **l'impact de l'activité de pêche** sur les ressources.

source: In addition, and based on the risk assessment conclusions, an objective of a minimum number of controls to perform on each fleet segment is defined.
fr: De plus, et sur la base des conclusions de l'évaluation des risques, un objectif d'un nombre minimum de contrôles à effectuer sur chaque segment de flotte est défini.

source: Fleet segments computation and display
fr: Calcul et affichage des segments de flotte

source: The :doc:`flows/current-segments` flow computes the fleet segments each vessel belongs to in real time, based on ERS data.
fr: Le flow :doc:`flows/current-segments` calcule les segments de flotte auxquels appartient chaque navire en temps réel, sur la base des données ERS.

source: Fishing vessels' fleet segment(s) can then be visualized on the map in real time, filtered based on their fleet segments...
fr: Le ou les segments de flotte des navires de pêche peuvent alors être visualisés sur la carte en temps réel, les navires peuvent être filtrés en fonction de leurs segments de flotte...

source: Map showing vessels with fleet segments labels
fr: Carte montrant les navires avec des étiquettes de segments de flotte
