Repository: MTES-MCT/monitorfish
Catalog: pipeline/docs/locale/*/LC_MESSAGES/flows.po
Languages: fr

source: What are flows?
fr: Que sont les flows ?

source: *Flows* are batch jobs that move and transform data. Collectively, they constitute the :ref:`data-pipeline` part of the Monitorfish architecture.
fr: Les *flows* sont des traitements qui déplacent et transforment les données. Collectivement, ils constituent la partie :ref:`data-pipeline` de l'architecture Monitorfish.

source: Each batch job is written as a `Prefect flow <https://docs.prefect.io/core/concepts/flows.html#overview>`__ which typically extracts data (from external sources and / or from tables in the Monitorfish database), processes the data and loads it back into a table of the Monitorfish database.
fr: Chaque traitement est écrit comme un `Flow Prefect <https://docs.prefect.io/core/concepts/flows.html#overview>`__ qui extrait typiquement des données (de sources externes et/ou de tables de la base de données Monitorfish), traite les données et les recharge dans une table de la base de données Monitorfish.

source: Flows are composed of `tasks <https://docs.prefect.io/core/concepts/tasks.html#overview>`__ typically written as python pure functions. `The UI <http://prefect.csam.e2.rie.gouv.fr/>`__ (restricted access) enables administrators to view each flow as a diagram of its constituent tasks, to monitor their execution, see the logs and debug in case any flow run fails...
fr: Les flows sont composés de `tâches <https://docs.prefect.io/core/concepts/tasks.html#overview>`__ typiquement écrites comme des fonctions pures en python. `L'interface utilisateur <http://prefect.csam.e2.rie.gouv.fr/>`__ (accès restreint) permet aux administrateurs de visualiser chaque flow sous la forme d'un diagramme des tâches qui le composent, de suivre leur exécution, de voir les logs, de déboguer en cas d'échec de l'exécution d'un flow...

source: Overview of flows in Monitorfish
fr: Vue d'ensemble des flux de données dans Monitorfish :

source: Flow that imports administrative areas :
fr: Flow qui importe les zones administratives

source: Schematic of administrative areas data flow
fr: Schéma du flow des zones administratives

source: Flows that import repositories (species, gears, infractions...) :
fr: Flows qui importent des référentiels (espèces, engins, infractions...) :

source: Schematic of repositories flows
fr: Schéma des flows de référentiels

source: Flows that import and perform a check-up on regulations data :
fr: Flows qui importent et vérifient la réglementation :

source: Schematic of regulation flows
fr: Schéma des flows de réglementation

source: Flows that perform computations that are internal to Monitorfish (alerts, fishing detection...):
fr: Flows qui réalisent des traitements de données internes à Monitorfish (alertes, détection de pêche...)

source: Schematic of internal computations flows
fr: Schéma des flows de traitements de données internes à Monitorfish

source: Flows that contribute to maintaining an up-to-date `last_positions` table :
fr: Flows qui contribuent à la mise à jour de la table de dernières positions

source: Schematic of last positions flows
fr: Schéma des flows de mise à jour de la table de dernières positions

source: List of flows
fr: Liste des flows
