Repository: MTES-MCT/monitorfish
Catalog: datascience/docs/locale/*/LC_MESSAGES/alerts.po
Languages: fr

source: Alerts
fr: Alertes

source: Monitorifsh performs **real time fraud detection** using VMS, logbook and regulations data. The types of fraud currenlty detected are :
fr: Monitorifsh effectue une **détection de fraude en temps réel** en utilisant les données VMS, le journal de pêche électronique et la réglementation. Les types de fraude actuellement détectés sont :

source: trawling in the french 3 nautical miles coastal strip
fr: le chalutage dans la bande côtière française des 3 milles nautiques

source: fishing in the french 12 nautical miles coastal strip by a non-french vessel (excluding historic fishing rights for certains states)
fr: la pêche dans la bande côtière française des 12 milles nautiques par un navire non français (hors droits de pêche historiques pour certains états)

source: fishing in the french Exclusive Economic Zone (EEZ) by a non-Community vessel
fr: pêche dans la zone économique exclusive (ZEE) française par un navire non communautaire

source: undeclared fishing activity : VMS track showing fishing activity with no corresponding Fishing Activity Report (FAR) in the electronic logbook
fr: activité de pêche non déclarée : trace VMS montrant une activité de pêche sans rapport d'activité de pêche (FAR) correspondant dans le journal de pêche électronique

source: undeclared departure at sea : VMS track showing a departure at sea with no corresponding Departure (DEP) declaration in the electronic logbook
fr: départ en mer non déclaré : trace VMS indiquant un départ en mer sans déclaration de départ (DEP) correspondante dans le journal de pêche électronique

source: suspicion of under-declaration : fishing effort non consistent with declared quantities
fr: suspicion de sous-déclaration : effort de pêche non cohérent avec les quantités déclarées

source: RTC fishing alert : VMS track showing fishing activity in a Real Time Closure (RTC) area
fr: alerte de pêche en zone RTC : Trace VMS indiquant une activité de pêche dans une zone de fermeture en temps réel (RTC)

source: NEAFC fishing alert : VMS track showing fishing activity in the NEAFC area (subject to authorization by NEAFC)
fr: alerte de pêche en zone CPANE : Trajectoire VMS indiquant une activité de pêche dans la zone CPANE (pêche soumise à autorisation de la CPANE)

source: exceeding the maximum authorized blue ling (BLI) quantity held onboard : logbook data showing more than 6 tons of blue ling (BLI) onboard a vessel present in area 27.6.a, which is the maximum quantity authorized by R(UE) 1241.
fr: dépassement de la quantité maximale autorisée de lingue bleue (BLI) détenue à bord : données du journal de bord indiquant la présence de plus de 6 tonnes de lingue bleue (BLI) à bord d'un navire présent dans la zone 27.6.a, qui est la quantité maximale autorisée par la R(UE) 1241.

source: When signs of fraud are detected on a vessel, it appears on the map with a red halo :
fr: Lorsque des signes de fraude sont détectés sur un navire, celui-ci apparaît sur la carte avec un halo rouge :

source: Map showing a vessel's VMS track which presents signs of illegal trawling in the 3 nautical miles coastal strip
fr: Carte montrant la piste VMS d'un navire qui présente des signes de chalutage illégal dans la bande côtière des 3 milles nautiques.

source: *Map showing a vessel's VMS track which presents signs of illegal trawling in the 3 nautical miles coastal strip*
fr: *Carte montrant la trace VMS d'un navire qui présente des signes de chalutage illégal dans la bande côtière des 3 milles nautiques*.

source: Alerts are then humanly checked and validated / invalidated. Validated alerts become *reportings* which are stored in the Monitorfish database and add the vessel's history.
fr: Les alertes sont ensuite vérifiées humainement et validées / invalidées. Les alertes validées deviennent des *signalements* qui sont stockés dans la base de données Monitorfish et s'ajoutent à l'historique du navire.

source: Alerts make use of the fishing detection algorithm of the :doc:`enrich position flow <flows/enrich-positions>`.
fr: Les alertes utilisent l'algorithme de détection d'activité de pêche du flow :doc:`enrich-positions <flows/enrich-positions>`.
