Repository: MTES-MCT/monitorfish
Catalog: datascience/docs/locale/*/LC_MESSAGES/control-priority-steering.po
Languages: fr

source: Control priority steering
fr: Pilotage des priorités de contrôle

source: Why it is needed
fr: A quoi ça sert

source: Reaching the :ref:`control objectives <risk-assessment>` defined at the national level is one of the missions of the FMC. In order to reach these objectives, the FMC needs a way to **target certain fleet segments** and to **dynamically adapt control priorities** depending on the level of achievement of the control objectives of each segment.
fr: Atteindre les :ref:`objectifs de contrôle <risk-assessment>` définis au niveau national est l'une des missions du FMC. Afin d'atteindre ces objectifs, le FMC doit pouvoir **cibler certains segments de flotte** et **adapter dynamiquement les priorités de contrôle** en fonction du niveau de réalisation des objectifs de contrôle de chaque segment.

source: In addition to the control objectives, the **seasonality of the activity** on the various segments is another factor that makes it necessary for the FMC to be able to adapt its control priorities dynamically. Indeed, certain fleet segments are of particular interest at known periods in the year.
fr: En plus des objectifs de contrôle, la **saisonnalité de l'activité** sur les différents segments est un autre facteur qui rend utile la possibilité pour le CSP d'adapter ses priorités de contrôle de manière dynamique. En effet, certains segments de flotte présentent un intérêt particulier à des périodes déterminées de l'année.

source: How it works
fr: Fonctionnement

source: The administration panel allows Monitorfish admins to steer control priorities by dynamically assigning a **control priority level** to each fleet segment :
fr: Le panneau d'administration permet aux administrateurs de Monitorfish de gérer les priorités de contrôle en attribuant dynamiquement un **niveau de priorité de contrôle** à chaque segment de flotte :

source: Control priority level
fr: Niveau de priorité du contrôle

source: Low
fr: Faible

source: Moderate
fr: Moyen

source: High
fr: Elevé

source: Very high
fr: Très élevé

source: The control priority level is then included in the computation of the :ref:`detectability score <detectability-score>` component of the risk factor. By assigning a higher control priority level to a certain fleet segment, the risk factor of all vessels belonging to this fleet segment in real time will be increased, and Monitorfish will automatically recommend control targets that correspond to this fleet segment, thus helping the FMC to reach its objectives.
fr: Le niveau de priorité de contrôle est ensuite inclus dans le calcul de la composante :ref:`score de détectabilité <detectability-score>` du facteur de risque. En attribuant un niveau de priorité de contrôle plus élevé à un segment de flotte, le facteur de risque de tous les navires appartenant à ce segment de flotte en temps réel sera augmenté, et Monitorfish recommandera automatiquement des cibles de contrôle correspondant à ce segment de flotte, aidant ainsi le FMC à atteindre ses objectifs.
