Repository: MTES-MCT/monitorfish
Catalog: datascience/docs/locale/*/LC_MESSAGES/data-sources.po
Languages: fr

source: Data sources
fr: Sources de données

source: VMS positions
fr: Positions VMS

source: VMS positions are received on an API endpoint provided by the Kotlin Springboot backend service.
fr: Les positions VMS sont reçues sur un point de terminaison API fourni par le service backend Kotlin Springboot.

source: Logbook xml files
fr: Fichiers xml de journal de pêche électronique

source: Logbook raw xml files are ingested by the :doc:`flows/logbook` flow from the `configured location <https://github.com/MTES-MCT/monitorfish/blob/master/datascience/config.py>`__ where logbook xml files must be deposited.
fr: Les fichiers xml bruts de journal de pêche électronique sont ingérés par le flow :doc:`flows/logbook` depuis `l'emplacement configuré <https://github.com/MTES-MCT/monitorfish/blob/master/datascience/config.py>`__ où les fichiers xml doivent être déposés.

source: Databases
fr: Bases de données

source: Data is imported - and kept in sync by periodically reimporting data - from these databases :
fr: Les données sont importées - et synchronisées grâce à une réimportation périodique - à partir des bases de données suivantes :

source: The OCAN database for :doc:`flows/vessels`
fr: La base de données OCAN pour les :doc:`flows/vessels`

source: The FMC2 database for :doc:`flows/beacons`
fr: La base de données FMC2 pour les :doc:`flows/beacons`

source: A data warehouse (also developped by the same team : https://github.com/MTES-MCT/fisheries-and-environment-data-warehouse) for :doc:`flows/vessel-profiles`
fr: Un entrepôt de données (également développé par la même équipe : https://github.com/MTES-MCT/fisheries-and-environment-data-warehouse) pour :doc:`flows/vessel-profiles`

source: The CROSS-A database for :doc:`flows/administrative-areas`, :doc:`flows/facade-areas`, :doc:`flows/ports`, :doc:`flows/regulations`
fr: La base de données CROSS-A pour :doc:`flows/administrative-areas`, :doc:`flows/facade-areas`, :doc:`flows/ports`, :doc:`flows/regulations`

source: Credentials for these data sources must be configured for Monitorfish to connect to them. See :ref:`environment_variables`.
fr: Les identifiants de ces sources de données doivent être configurés pour que Monitorfish puisse s'y connecter. Voir :ref:`environment_variables`.

source: Other sources
fr: Autres sources de données

source: The following sources are also used :
fr: Les sources suivantes sont également utilisées :

source: The `fao.org <https://www.fao.org/>`__ website for FAO areas and species referencials
fr: Le site web `fao.org <https://www.fao.org/>`__ pour les référenciels FAO de zones et d'espèces

source: The legipeche intranet website is scraped and user for for :doc:`regulations data checkup <flows/regulations-checkup>`
fr: Le site intranet legipeche est scrapé et utilisé pour :doc:`la vérification des données réglementaires <flows/regulations-checkup>`
