Repository: MTES-MCT/monitorfish
Catalog: datascience/docs/locale/*/LC_MESSAGES/deployment.po
Languages: fr

source: Deployment & Administration
fr: Déploiement & administration

source: Prerequisites
fr: Prérequis

source: Dependencies
fr: Dépendances

source: The following dependencies must be installed on the production machine :
fr: Les dépendances suivantes doivent être installées sur la machine de production

source: Cloning the repository
fr: Cloner le dépôt

source: Clone the repo with :
fr: Clonez le dépôt avec :

source: Environment variables
fr: Variables d'environnement

source: A ``.env`` file must be created in the ``datascience`` folder, with all the variables listed in ``.env.template`` filled in.
fr: Un fichier ``.env`` doit être créé dans le dossier ``datascience``, avec toutes les variables listées dans ``.env.template`` remplies.

source: Set the ``MONITORFISH_VERSION`` environment variable. This will determine which docker images to pull when running ```make`` commands.
fr: Définissez la variable d'environnement ``MONITORFISH_VERSION``. Cela déterminera les images docker à extraire lors de l'exécution des commandes ``make``

source: ERS files
fr: Fichiers ERS

source: ERS raw xml files are ingested by the ERS flow from the configured ``ERS_FILES_LOCATION`` in ``datascience/config.py``. In order to make ERS data available to Monitorfish, ERS files should therefore be deposited in this directory.
fr: Les fichiers xml bruts ERS sont ingérés par le flow ERS à partir du répertoire configuré ``ERS_FILES_LOCATION`` dans ``datascience/config.py``. Afin de rendre les données ERS disponibles pour Monitorfish, les fichiers ERS doivent donc être déposés dans ce répertoire.

source: Running the database service
fr: Exécution de la base de données

source: The Monitorfish database must be running for data processing operations to be carried out. For this, run the backend service first.
fr: La base de données Monitorfish doit être en cours d'exécution pour que les opérations de traitement des données puissent être effectuées. Pour cela, lancez d'abord le service backend.

source: Running the orchestration service
fr: Exécution de l'orchestrateur

source: Starting the Prefect server orchestrator
fr: Démarrer l'orchestrateur Prefect server

source: The orchestration service can be started with :
fr: L'orchestrateur est lancé par la commande suivante :

source: Automating log cleaning
fr: Automatiser le nettoyage des logs

source: Logs of past flow runs are stored in a Postgres database that is part of the prefect server architecture. In order to keep the size of this database low, it is necessary to set up a cron job to delete old flow runs.
fr: Les logs des exécutions de flows passées sont stockés dans une base de données Postgres qui fait partie de l'architecture de l'orchestrateur Prefect server. Afin de limiter la taille de cette base de données, il est nécessaire de mettre en place une tâche cron pour supprimer les anciens logs.

source: The Prefect server database runs in a Docker container. The script ``infra/remote/data-pipeline/truncate-old-prefect-logs.sh`` goes into that container with ``docker exec`` and runs a ``DELETE`` query to delete old flow_runs.
fr: La base de données du serveur Prefect est exécutée dans un conteneur Docker. Le script ``infra/remote/data-pipeline/truncate-old-prefect-logs.sh`` entre dans ce conteneur avec ``docker exec`` et exécute une requête ``DELETE`` pour supprimer les anciens flow_runs.

source: This query can be run daily by setting up a cron job, for instance by adding a line to the crontab file :
fr: Cette requête peut être exécutée quotidiennement en configurant une tâche cron, par exemple en ajoutant une ligne au fichier crontab :

source: then add the line in ``infra/remote/data-pipeline/crontab.txt`` (after updating the scripts and logs locations as needed) in the crontab file.
fr: puis ajouter la ligne dans ``infra/remote/data-pipeline/crontab.txt`` (après avoir mis à jour les emplacements des scripts et des logs si nécessaire) dans le fichier crontab.

source: Running the execution service
fr: Exécution du service de traitement de données

source: The execution service can be started with :
fr: Le service de traitement de données est lancé par la commande suivante :

source: Database backup & restore
fr: Sauvegarde et restauration de base de données

source: This section explains how to perform and automate full database backups.
fr: Cette section explique comment effectuer et automatiser des sauvegardes complètes de bases de données.

source: Create a backups folder on the host machine.
fr: Créez un dossier de sauvegardes sur la machine hôte.

source: Create ``MONITORFISH_BACKUPS_FOLDER`` entry with the full path to the backups folder in ~/.monitorfish - e.g.g. ``export MONITORFISH_BACKUPS_FOLDER="/backups/"``.
fr: Créez l'entrée ``MONITORFISH_BACKUPS_FOLDER`` avec le chemin complet vers le dossier des sauvegardes dans ~/.monitorfish - par exemple, ``export MONITORFISH_BACKUPS_FOLDER="/backups/"``.

source: Create ``MONITORFISH_LOGS_AND_BACKUPS_GID`` entry in ~/.monitorfish with the group that owns the backups folder (the database container with be run with this group so it can write to the backups folder on the host) - e.g.g. ``export MONITORFISH_LOGS_AND_BACKUPS_GID="125"``.
fr: Créez l'entrée ``MONITORFISH_LOGS_AND_BACKUPS_GID`` dans ~/.monitorfish avec le groupe qui possède le dossier des sauvegardes (le conteneur de base de données sera exécuté avec ce groupe afin qu'il puisse écrire dans le dossier des sauvegardes sur l'hôte) - par exemple, ``export MONITORFISH_LOGS_AND_BACKUPS_GID="125"``.

source: Make a copy of ``infra/remote/backup/pg_backup.config.template`` and rename it ``pg_backup.config``.
fr: Faites une copie de ``infra/remote/backup/pg_backup.config.template`` et renommez-la ``pg_backup.config``.

source: Optionnally, change the backup parameters in ``pg_backup.config``.
fr: En option, changez les paramètres de sauvegarde dans ``pg_backup.config``.

source: Backup
fr: Sauvegarde

source: Running the backup script
fr: Exécuter le script de sauvegarde

source: Once the configuration step is done, a backup can be made by running the script at ``infra/remote/backup/pg_backup_rotated.sh``.
fr: Une fois l'étape de configuration effectuée, une sauvegarde peut être faite en exécutant le script à ``infra/remote/backup/pg_backup_rotated.sh``.

source: This script :
fr: Ce script :

source: ``docker execs`` into the database container and makes a full database backup using ``pg_dump``
fr: ``docker execs`` dans le conteneur de la base de données et fait une sauvegarde complète de la base de données en utilisant ``pg_dump``.

source: outputs :
fr: renvoie :

source: a single ``globals.sql.gz`` file that contains database globals (roles, tablespaces)
fr: un unique fichier ``globals.sql.gz`` qui contient les globaux de la base de données (rôles, tablespaces)

source: a ``*.custom`` file (full database dump in compressed `custom` postgres format) for each database on the postgres cluster
fr: un fichier ``*.custom`` ( dump complet de la base de données au format compressé `custom` postgres) pour chaque base de données du cluster postgres.

source: stores these files on the host machine, in a subfolder of the backups folder, named with the date of the backup
fr: stocke ces fichiers sur la machine hôte, dans un sous-dossier du dossier des sauvegardes, nommé avec la date de la sauvegarde.

source: deletes old backups in rotation, keeping daily and weekly backups for as long as specified in the ``pg_backup.config`` file
fr: supprime les anciennes sauvegardes par rotation, en gardant les sauvegardes quotidiennes et hebdomadaires aussi longtemps que spécifié dans le fichier ``pg_backup.config``.

source: Automating backups
fr: Automatisation des sauvegardes

source: To automate backups, add the line ``infra/remote/backup/crontab.txt`` to the crontab file :
fr: Pour automatiser les sauvegardes, ajoutez la ligne ``infra/remote/backup/crontab.txt`` au fichier crontab :

source: We recommend running the backup script daily.
fr: Nous recommandons d'exécuter le script de sauvegarde quotidiennement.

source: Restore
fr: Restauration à partir d'une sauvegarde

source: To restore from a backup, see `TimescaleDB documentation <https://legacy-docs.timescale.com/v1.7/using-timescaledb/backup#pg_dump-pg_restore>`_.
fr: Pour restaurer à partir d'une sauvegarde, voir `la documentation de TimescaleDB <https://legacy-docs.timescale.com/v1.7/using-timescaledb/backup#pg_dump-pg_restore>`_.
