Repository: MTES-MCT/monitorfish
Catalog: datascience/docs/locale/*/LC_MESSAGES/index.po
Languages: fr

source: Overview
fr: En bref

source: **Monitorfish** is a **fishing vessels monitoring software** developped by the French adminitration for the french **Fishing Monitoring Center (FMC)** - the `Centre National de Surveillance des Pêches <https://www.mer.gouv.fr/la-police-des-peches>`_ - and its partners.
fr: **Monitorfish** est un **logiciel de surveillance des navires de pêche** développé par l'administration française pour le **Fishing Monitoring Center (FMC)** français - le `Centre National de Surveillance des Pêches <https://www.mer.gouv.fr/la-police-des-peches>`_ - et ses partenaires.

source: Features
fr: Fonctionnalités

source: Visualization of fishing vessels' real time **positions** (VMS)
fr: Visualisation des **positions** des navires de pêche en temps réel (VMS)

source: Visualization of fishing vessels' declarative **fishing activity** data (ERS)
fr: Visualisation des données déclaratives de **l'activité de pêche** des navires de pêche (ERS)

source: Visualization of fishing vessels' historical **controls** and **violations**
fr: Visualisation de l'historique des **contrôles** et des **infractions** des navires de pêche

source: Visualization of :doc:`regulated fishing areas <regulation>` of the french and european regulations
fr: Visualisation des :doc:`zones de pêche réglementées <regulation>` de la réglementation française et européenn

source: Computation of fishing vessels' real time belonging to :doc:`fleet segments <fleet-segments>` as defined by the `European Fishing Control Agency (EFCA) <https://www.efca.europa.eu/en>`_ in its `risk assessment methodology <https://www.efca.europa.eu/en/content/guidelines-risk-assessment-methodology-fisheries-compliance>`_
fr: Calcul en temps réel de l'appartenance des navires de pêche aux :doc:`segments de flotte <fleet-segments>` tels que définis par `l'Agence européenne de contrôle des pêches (EFCA) <https://www.efca.europa.eu/en>`_ dans sa `méthodologie d'évaluation des risques <https://www.efca.europa.eu/en/content/guidelines-risk-assessment-methodology-fisheries-compliance>`_.

source: Real time fraud detection :doc:`alerts <alerts>`
fr: :doc:`Alertes <alerts>` de détection de fraude en temps réel

source: Computation of fishing vessels' real time :doc:`risk factor <risk-factor>`, a metric developed in the context of the Monitorfish project that aims to help FMC agents **prioritize vessels to control** based on all the above elements
fr: Calcul du :doc:`facteur de risque <risk-factor>` des navires de pêche en temps réel, une métrique développée dans le cadre du projet Monitorfish qui vise à aider les agents du FMC à **prioriser les navires à contrôler** sur la base des éléments ci-dessus.

source: Administration panel that allows admins to
fr: Interface d'administration qui permet aux administrateurs de

source: Update regulation data : update authorized fishing areas / periods / gears...
fr: Mettre à jour les données réglementaires : mise à jour des zones / périodes / engins de pêche autorisés...

source: Update the definitions of :doc:`fleet segments <fleet-segments>`
fr: Mettre à jour les définitions de :doc:`segments de flotte <fleet-segments>`

source: :doc:`Stear control priorities <control-priority-steering>` by dynamically adjuting the control priority level of each fleet segment
fr: :doc:`Piloter les priorités de contrôle <control-priority-steering>` en ajustant dynamiquement le niveau de priorité de contrôle de chaque segment de flotte

source: Demo
fr: Démo

source: Table of contents
fr: Sommaire
