Repository: MTES-MCT/monitorfish
Catalog: datascience/docs/locale/*/LC_MESSAGES/risk-factor.po
Languages: fr

source: Risk factor
fr: Facteur de risque

source: The risk factor is a metric computed for each vessel based its historical and real time data aimed at helping FMC agents prioritize vessels to control.
fr: Le facteur de risque est une métrique calculée pour chaque navire sur la base de ses données historiques et en temps réel. Il a pour but d'aider les agents du FMC à hiérarchiser les navires à contrôler.

source: It is computed and constantly updated by the :doc:`flows/risk-factor` flow.
fr: Il est calculé et constamment mis à jour par le flow :doc:`flows/risk-factor`.

source: Principle
fr: Principe

source: In accordance with EFCA's `Guidelines on Risk Assessment Methodology <https://www.efca.europa.eu/en/content/guidelines-risk-assessment-methodology-fisheries-compliance>`_, the computation of the risk factor of each vessel is based on an estimatation of the *probability* that a given vessel is in a non-compliance situation and an estimation of the potential *impact* of the non-compliance.
fr: Conformément aux `Lignes directrices sur la méthodologie d'évaluation des risques <https://www.efca.europa.eu/en/content/guidelines-risk-assessment-methodology-fisheries-compliance>`_ de l'EFCA, le calcul du facteur de risque de chaque navire est basé sur une estimation de la *probabilité* qu'un navire donné soit en situation de non-conformité et une estimation de l'*impact* potentiel de la non-conformité.

source: In addition, in order to reflect the objective of FMCs to efficiently distribute control efforts across all segments and vessels in order to miminize the possibility of violations to go undetected, a third component of *detectability* is added, which measures how well distributed accross fleet segments and accross fishing vessels of each fleet segment.
fr: De plus, afin de refléter l'objectif du FMC de répartir efficacement les efforts de contrôle entre tous les segments de flotte et tous les navires afin de réduire au minimum la possibilité que des infractions ne soient pas détectées, une troisième composante de "détectabilité" est ajoutée, qui mesure le degré de répartition de l'effort de contrôle entre les segments de flotte et entre les navires de pêche de chaque segment de flotte.

source: The obtained metric is therefore analogous to the *risk priority number (RPN)* of the widely used `FMEA <https://en.wikipedia.org/wiki/Failure_mode_and_effects_analysis>`_ risk assessment methodology, in which *probability*, *severity* and *detectability* are the 3 components of the RPN.
fr: La mesure obtenue est donc analogue au *risk priority number (RPN)* de la méthode d'évaluation des risques largement utilisée `FMEA <https://en.wikipedia.org/wiki/Failure_mode_and_effects_analysis>`_, dans laquelle *probabilité*, *impact* et *détectabilité* sont les 3 composantes du RPN.

source: Risk factor components
fr: Composantes du facteur de risque

source: Fishing vessels with higher risk factors constitute priority control target.
fr: Les navires de pêche présentant des facteurs de risque plus élevés constituent une cible de contrôle prioritaire.

source: Computation
fr: Calcul

source: Probability score
fr: Score de probabilité

source: The *probability* estimate of each fishing vessel is based on its historical control results. Put simply, a fishing vessel which was caught many times in a situation of non-compliance in the past is estimated to have a higher probability of future infringements than a fishing vessel which was historically controlled without non-compliance.
fr: Le score de *probabilité* de chaque navire de pêche est basé sur ses résultats historiques de contrôle. En d'autres termes, on estime qu'un navire de pêche qui a été pris à de nombreuses reprises en situation de non-conformité a une probabilité de commettre des infractions à l'avenir qui est plus élevée qu'un navire de pêche qui a toujours été en règles par le passé.

source: The computation is performed in two steps :
fr: Le calcul est effectué en deux étapes :

source: 1. Computation of an infraction score
fr: 1. Calcul d'un score d'infraction

source: Taking into account control results of the last 5 years, the last 10 control results are assigned :
fr: En tenant compte des résultats de contrôle des 5 dernières années, on attribue à chacun des 10 derniers résultats de contrôle :

source: a **score** equal to -1 if the control did not reveal any fishing non-compliance, and equal to 10 times the number of fishing violations committed if there were any
fr: un **score** égal à -1 si le contrôle n'a révélé aucune infraction de pêche, et égal à 10 fois le nombre d'infractions de pêche commises s'il y en a eu

source: a **coefficient** equal to 1 for the last control, 0.9 for the second-to-last control, ...
fr: un **coefficient** égal à 1 pour le dernier contrôle, 0,9 pour l'avant-dernier contrôle, ...

source: An **infraction score** is then computed as follows :
fr: Un **score d'infraction** est alors calculé comme suit :

source: infraction\ score=\sum_{i=0}^{9}(1-\frac{i}{10})(10*I_i-\delta_{0I_i})
fr: score\ d'infraction=\sum_{i=0}^{9}(1-\frac{i}{10})(10*I_i-\delta_{0I_i})

source: Where
fr: Où

source: :math:`i` is the index of the control, from most recent (0) to least recent (9)
fr: :math:`i` est l'indice du contrôle, du plus récent (0) au plus vieux (9)

source: :math:`I_i` is the number of fishing infractions committed and picked up during the control :math:`i`
fr: :math:`I_i` est le nombre d'infractions de pêche commises et relevées pendant le contrôle :math:`i`

source: :math:`\delta_{0I_i}` is equal to 1 if :math:`I_i=0` and equal to 0 otherwise
fr: :math:``delta_{0I_i}` est égal à 1 si :math:`I_i=0` et égal à 0 sinon

source: This can be illustrated as follows :
fr: Ceci peut être illustré comme suit :

source: Schematic of the computation of the infraction score
fr: Schéma du calcul du score d'infraction

source: 2. Binning of the infraction score
fr: 2. Regroupement par classes de scores d'infraction

source: The *probability* component of the risk factor is defined based on the infraction score of the vessel :
fr: La composante *probabilité* du facteur de risque est définie sur la base du score d'infraction du navire :

source: Infraction score
fr: Score d'infraction

source: 1 (best)
fr: 1 (meilleur)

source: 4 (worst)
fr: 4 (pire)

source: A vessel that never committed any violation has a negative infraction score and therefore a probability score of 1, whereas a fishing vessel that committed many violations can have a score of more than 50 and will therefore have the highest probability score of 4.
fr: Un navire qui n'a jamais commis d'infraction a un score d'infraction négatif et donc un score de probabilité de 1, alors qu'un navire de pêche qui a commis de nombreuses infractions peut avoir un score de plus de 50 et aura donc le score de probabilité le plus élevé de 4.

source: In the above example, with the infraction score of 13.4, the vessel has a probability score of 3.
fr: Dans l'exemple ci-dessus, avec un score d'infraction de 13,4, le navire a un score de probabilité de 3.v

source: Impact score
fr: Score d'impact

source: The *impact* score is defined by taking the risk level of the :doc:`fleet segment <fleet-segments>` a fishing vessel belongs to in real time. This risk level is evaluated each year for each fleet segment during the *risk assessment* process.
fr: Le *score d'impact* est défini en prenant le niveau de risque du :doc:`segment de flotte <fleet-segments>` auquel appartient un navire de pêche en temps réel. Ce niveau de risque est évalué chaque année pour chaque segment de flotte au cours du processus d'évaluation des risques.

source: If a fishing vessel belongs to several fleet segments, its *impact score* is defined as the highest risk level among the fleet segments it belongs to.
fr: Si un navire de pêche appartient à plusieurs segments de flotte, son *score d'impact* est défini comme le niveau de risque le plus élevé parmi les segments de flotte auxquels il appartient.

source: Detectability score
fr: Score de détectabilité

source: The *detectability* score is higher for vessels that have been little controlled over the past years and for vessels that belong to fleet segments that have a higher :doc:`control priority level <control-priority-steering>`. It is based on two components :
fr: Le *score de détectabilité* est plus élevé pour les navires qui ont été peu contrôlés au cours des dernières années et pour les navires qui appartiennent à des segments de flotte dont le :doc:`niveau de priorité de contrôle <control-priority-steering>` est plus élevé . Il est basé sur deux composantes :

source: the fishing vessel's fleet segment :doc:`control priority level <control-priority-steering>`
fr: le :doc:`niveau de priorité de contrôle <control-priority-steering>` du segment de flotte du navire de pêche

source: the fishing vessel's :ref:`control level <control-level>`
fr: le :ref:`niveau de contrôle <control-level>` du bateau de pêche

source: Control level
fr: Niveau de contrôle

source: A fishing vessel's control level is defined in two steps :
fr: Le niveau de contrôle d'un navire de pêche est défini en deux étapes :

source: 1. Time-base weighting of the number of controls
fr: 1. Pondération temporelle du nombre de contrôles

source: The controls of the past 3 years are counted with a linearly decreasing weight :
fr: Les contrôles des 3 dernières années sont comptés avec un poids linéairement décroissant :

source: Schematic of the number of recent controls computation method
fr: Schéma de la méthode de calcul du nombre de contrôles récents

source: We thus obtain a **'number of recent controls'**.
fr: On obtient ainsi un **"nombre de contrôles récents "**.

source: 2. Binning on the number of controls and time since the last control
fr: 2. Ventilation en fonction du nombre de contrôles et du temps écoulé depuis le dernier contrôle

source: Based on the above *number of recent controls*, as well as on the date of the most recent control, the *control level* is defined by binning according to the following schema :
fr: Sur la base du *nombre de contrôles récents* ci-dessus, ainsi que de la date du contrôle le plus récent, le *niveau de contrôle* est défini par ventilation selon le schéma suivant :

source: Schematic of the control level computation method
fr: Schéma de la méthode de calcul du niveau de contrôle

source: Detectability score computation
fr: Calcul du score de détectabilité

source: The detectability score of the fishing vessel is simply the geometric mean between the fishing vessel's control level and the control priority level of its fleet segment(s).
fr: Le score de détectabilité du navire de pêche est simplement la moyenne géométrique entre le niveau de contrôle du navire de pêche et le niveau de priorité de contrôle de son ou ses segments de flotte.

source: detactability\ score=\sqrt{Vessel\ Control\ Level*Fleet\ Segment\ Control\ Priority\ Level}
fr: détectabilité=\sqrt{niveau\ de\ contrôle\ du\ navire*priorité\ de\ contrôle\ du\ segment}

source: Like for the impact score, of the vessel belongs to several fleet segments, the highest of the control priority levels is used, and if it does not belong to any fleet segment, the minimum control priority (1) is used.
fr: Comme pour le score d'impact, si le navire appartient à plusieurs segments de flotte, le plus élevé des niveaux de priorité de contrôle des segments de flotte du navire est utilisé, et s'il n'appartient à aucun segment de flotte, la priorité de contrôle minimale (1) est utilisée.

source: Risk factor calculation
fr: Calcul du facteur de risque

source: The risk factor is a weighted geometric mean of its 3 components :
fr: Le facteur de risque est une moyenne géométrique pondérée de ses 3 composantes :

source: risk\ factor= impact\ score^{0.2}*probability\ score^{0.3}*detectability\ score^{0.5}
fr: facteur\ de\ risque= score\ d'impact^{0.2}*score\ de\ probabilité^{0.3}*score\ de\ détectabilité^{0.5}

source: The coefficients were adjusted based on workshops conducted with agents of the french FMC. Case studies using real data from the application were used to determine the importance of each factor in the FMC agents' judgement.
fr: Les coefficients ont été ajustés sur la base d'ateliers menés avec des agents du FMC français. Des études de cas utilisant des données réelles de l'application ont été utilisées pour déterminer l'importance de chaque facteur dans le jugement des agents du FMC.
